/*
 * 가변형 인수 : 메서드의 파라미터의 개수가 실행될때마다 다르게 사용한다.
 * - 가변형 인수는 메서드 안에서 배열로 처리된다.
 * - 가변형 인수는 하나의 메서드에 한가지만 사용 할 수 있다.
 */

package kr.or.ddit.basic;

public class ArgsTest {

	//1.파라미터로 넘겨주는 데이터의 개수가 호출 할 때마다 수시로 변할 때의 방법
	//1)배열을 이용한 방법
	public int sumArr(int[] data) { //b 배열이 가지고 있는 데이터의 합계를 구해보기
		int sum = 0;

		for (int i = 0; i < data.length; i++) {	//c
			sum += data[i];
		}

		return sum;	//d
	}	
	
////////////////////////////////////////////////////////////////////////////////////////////////
	
	//2. 가변형 인수를 사용한 메서드(메서드 안에서는 배열로 처리됨)
	public int sumArg(int...data) {		
//	public int sumArg(int...data, double...data){//가변형 인수는 하나의 메소드에는 하나만 사용할 수 있기 때문에 두가지 가변형인수가 올 수 없음
		
		int sum = 0;

		for (int i = 0; i < data.length; i++) {
			sum += data[i];
		}

		return sum;
	}
	
////////////////////////////////////////////////////////////////////////////////////////////////
	
	//3. 가변형 인수를 사용한 메서드2
	//가변형 인수는 한 메서드안에 하나만 사용가능하지만, 일반변수(일반 매개변수)와는 같이 사용 가능
	//가변형 인수와 일반 매개변수를 같이 사용할 경우에는 가변형인수를 가장 뒤쪽에 배치해야 한다.
	public String sumArg(String name, int...data) {			
		
		int sum = 0;

		for (int i = 0; i < data.length; i++) {
			sum += data[i];
		}

		return name + "씨 총점 : " + sum;
	}	
	
////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////
	
	public static void main(String[] args) {
		//1)-1.
		ArgsTest test = new ArgsTest();//a
		
		//1)-2.직접 데이터 넣기
		System.out.println(test.sumArr(new int[] {1,2,3,4,5}));	//b
		//출력값 ) 15
		
		//1)-3.배열을 선언하는것과 동시에 초기화
		int[]nums1 = {100,200,300};	//b	
		System.out.println(test.sumArr(nums1));	//e
		//출력값 ) 600
		
		//1)-4. 배열 선언과 초기화 분리
//		int[]nums2 = new int[] {1,2,3,4,5};	//b
		int[]nums2;
		nums2 = new int[]{1,2,3,4,5}; //이렇게 분리가 가능
		System.out.println(test.sumArr(nums2));	//e
		//출력값 ) 15
	
	
//////////////////////////////////////////////////////////////////////////////////////////////
		
		//2-1.가변형 인수 =>다른거 넣을 필요없이 값만 넣어주면 됨.
		System.out.println(test.sumArg(100,200,300));
		//출력값 ) 600
		
		System.out.println(test.sumArg(1,2,3,4,5));
		//출력값 ) 15
		
//////////////////////////////////////////////////////////////////////////////////////////////
		
		//3-1.
		System.out.println(test.sumArg("홍길동",1,2,3,4,5,6,7));
		//출력값 ) 홍길동씨 총점 : 28
	
	
	}



	
	
	
}
